<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"2700e07bd1d32a631cce461065fa9c337fc05fcf831fa9c36677dd111084218b","plan_job_ref":"Job .github/workflows/_test-tf.yaml #23 at https://github.com/DND-IT/github-workflows/actions/runs/14620469218","plan_out_hash":"035d0e37161b59cfbc65e3275a6e8d99c91ff37e61700623eb8cefac91299e2e","plan_hash":"7b8da86122489c579974bc757fe0ec9f2556dfed5850cbae3fa0d9062d9e7366","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

  # module.workflow_test_docker_buildx_ecr.aws_ecr_lifecycle_policy.this[0] will be destroyed
  # (because aws_ecr_lifecycle_policy.this is not in configuration)
-   resource "aws_ecr_lifecycle_policy" "this" {
-       id          = "test-docker-buildx-push" -> null
-       policy      = jsonencode(
            {
-               rules = [
-                   {
-                       action       = {
-                           type = "expire"
                        }
-                       description  = "Remove Images older than 1 day"
-                       rulePriority = 1
-                       selection    = {
-                           countNumber = 1
-                           countType   = "sinceImagePushed"
-                           countUnit   = "days"
-                           tagStatus   = "any"
                        }
                    },
                ]
            }
        ) -> null
-       registry_id = "911453050078" -> null
-       repository  = "test-docker-buildx-push" -> null
    }

  # module.workflow_test_docker_buildx_ecr.aws_ecr_repository.this[0] will be destroyed
  # (because aws_ecr_repository.this is not in configuration)
-   resource "aws_ecr_repository" "this" {
-       arn                  = "arn:aws:ecr:eu-central-1:911453050078:repository/test-docker-buildx-push" -> null
-       id                   = "test-docker-buildx-push" -> null
-       image_tag_mutability = "IMMUTABLE" -> null
-       name                 = "test-docker-buildx-push" -> null
-       registry_id          = "911453050078" -> null
-       repository_url       = "911453050078.dkr.ecr.eu-central-1.amazonaws.com/test-docker-buildx-push" -> null
-       tags                 = {
-           "Usage" = "Automated tests from github-workflows/_test-docker.yaml"
        } -> null
-       tags_all             = {
-           "Usage" = "Automated tests from github-workflows/_test-docker.yaml"
        } -> null

-       encryption_configuration {
-           encryption_type = "AES256" -> null
#            (1 unchanged attribute hidden)
        }

-       image_scanning_configuration {
-           scan_on_push = false -> null
        }
    }

  # module.workflow_test_docker_buildx_ecr.aws_ecr_repository_policy.this[0] will be destroyed
  # (because aws_ecr_repository_policy.this is not in configuration)
-   resource "aws_ecr_repository_policy" "this" {
-       id          = "test-docker-buildx-push" -> null
-       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "ecr:ListTagsForResource",
-                           "ecr:ListImages",
-                           "ecr:GetRepositoryPolicy",
-                           "ecr:GetLifecyclePolicyPreview",
-                           "ecr:GetLifecyclePolicy",
-                           "ecr:GetDownloadUrlForLayer",
-                           "ecr:GetAuthorizationToken",
-                           "ecr:DescribeRepositories",
-                           "ecr:DescribeImages",
-                           "ecr:DescribeImageScanFindings",
-                           "ecr:BatchGetImage",
-                           "ecr:BatchCheckLayerAvailability",
                        ]
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS = "arn:aws:iam::911453050078:root"
                        }
-                       Sid       = "PrivateReadOnly"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       registry_id = "911453050078" -> null
-       repository  = "test-docker-buildx-push" -> null
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:x: Error applying plan in [.github/workflows/_test-tf.yaml #23](https://github.com/DND-IT/github-workflows/actions/runs/14620469218)